In [223]:
import pandas as pd
import numpy as np

In [237]:
data = {'Subject': ['Maths', 'History', 'Science', 'English', 'Georaphy', 'Art'],
        'Marks': (45, 65, 78, 65, 80, 78),
        'CGPA': [2.5, 3.0, 3.5, 2.0, 4.0, 4.0]}

In [244]:
data = {'Subject': [1, 2, 6, 'English', 'Georaphy', 'Art'],
        'Marks': (45, 65, 78, 65, 80, 78),
        'CGPA': [2.5, 3.0, 3.5, 2.0, 4.0, 4.0]}

In [245]:
df=pd.DataFrame(data)
df

    Subject  Marks  CGPA
0         1     45   2.5
1         2     65   3.0
2         6     78   3.5
3   English     65   2.0
4  Georaphy     80   4.0
5       Art     78   4.0

In [247]:
Subject = pd.Series(['Maths', 'History', 'Science', 'English', 'Georaphy', 'Art'])
Marks = pd.Series([45, 65, 78, 65, 80, 78])
CGPA = pd.Series([2.5, 3.0, 3.5, 2.0, 4.0, 4.0])

In [268]:
pd.DataFrame([Subject,Marks,CGPA], index = ['a','b','c']).T

          a   b    c
0     Maths  45  2.5
1   History  65  3.0
2   Science  78  3.5
3   English  65  2.0
4  Georaphy  80  4.0
5       Art  78  4.0

In [256]:
data=pd.read_csv('example.csv')
data

    Age  Weight (in kg)  Height (in m)
0    45              60           1.35
1    12              43           1.21
2    54              78           1.50
3    26              65           1.21
4    68              50           1.32
5    21              43           1.52
6    10              32           1.65
7    57              34           1.61
8    75              23           1.24
9    32              21           1.52
10   23              53           1.50
11   34              65           1.76
12   55              89           1.65
13   23              45           1.75
14   56              76           1.69
15   67              78           1.85
16   26              65           1.21
17   56              74           1.69
18   67              78           1.85
19   26              65           1.21
20   68              50           1.32
21   56              76           1.69
22   67              78           1.85

In [264]:
data.Age.dtypes

dtype('int64')

In [275]:
a1 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']
a2 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']
a3 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']
school = [a1, a2, a3]
inst = ['School_1', 'School_2', 'School_3']
Muggle_data = pd.DataFrame(data=school, columns=inst)
Muggle_data

   School_1    School_2     School_3
0  Hogwarts  Durmstrang  Beauxbatons
1  Hogwarts  Durmstrang  Beauxbatons
2  Hogwarts  Durmstrang  Beauxbatons

In [278]:
a=["weight","height","age"]
b1=[122,43,21]
b2=[22,4,34]
b3=[65,5,33]

In [280]:
df=pd.DataFrame([b1,b2,b3])

TypeError: __init__() got an unexpected keyword argument 'column'

In [ ]:
df

          0   1   2
weight  122  43  21
height   22   4  34
age      65   5  33